{
  "basics": {
    "name": "Patrick L. Taylor",
    "image": "",
    "email": "p.taylor23@imperial.ac.uk",
    "summary": "I'm currently a postdoc at Imperial College, London—prior to which I completed a PhD at Cambridge. My current work is on applying ML to detect in-situ defect formation in metal additive manufacturing (AM). Whilst I am currently developing large deep learning models, my PhD project used Bayesian models trained on smaller datasets for use in materials design, giving me broad experience applying ML and data-driven analysis in science."
  },
  "work": [
    {
      "name": "Mechanical Engineering Department, Imperial College London",
      "position": "Postdoctoral Research Associate",
      "startDate": "2023",
      "summary": "Developing deep learning algorithms to detect defect formation in laser powder bed fusion additive manufacturing. The role involves close collaboration with experimental colleagues and industrial collaborators. I am also supervising undergraduate research projects."
    },
    {
      "name": "Physics Department, University of Cambridge",
      "position": "Supervisor (undergraduate teaching)",
      "startDate": "2019",
      "endDate": "2022",
      "summary": "Delivered 1-on-3 supervisions for 3rd year statistical mechanics, and demonstrated for 3rd year computing courses."
    },
    {
      "name": "Physics Department, University of Oxford",
      "position": "Web development intern",
      "startDate": "2018",
      "endDate": "2018",
      "summary": "Built and wrote content for an outreach website for the Quantum Theory Group."
    },
    {
      "name": "Physics Department, University of Oxford",
      "position": "Summer research project intern",
      "startDate": "2017",
      "endDate": "2017",
      "summary": "Modelled the magnetisation of type-II superconductors suing COMSOL."
    }
  ],
  "education": [
    {
      "institution": "Physics Department, University of Cambridge",
      "area":"Material informatics [Thesis: Machine learning approach to model the microstructure and strength of nickel superalloys]",
      "studyType": "PhD",
      "startDate": "2019",
      "endDate": "2023"
    },
    {
      "institution": "Physics Department, University of Cambridge",
      "area":"Scientific Computing",
      "studyType": "MPhil",
      "startDate": "2018",
      "endDate": "2019"
    },
    {
      "institution": "Hertford College, University of Oxford",
      "area":"Mathematical and theoretical physics",
      "studyType": "MMathPhys (undergraduate degree)",
      "startDate": "2014",
      "endDate": "2018",
      "score": "1st class honours"
    }
  ],
  "publications": [
    {
      "name": " Machine learning superalloy microchemistry and creep strength from physical descriptors",
      "publisher": "Comp. Mat. Sci., 227",
      "releaseDate": "2023",
      "url": "https://doi.org/10.1016/j.commatsci.2023.112265",
      "summary": "An element-agnostic set of descriptors is proposed to model superalloy properties with Gaussian process regression. Furthermore, we develop a correction method to deliver the best and most physical predictions for microchemistry in multi-phase alloys. The model's performance in predictions is confirmed for superalloy microchemistry, microstructure, and strength properties. When including new, unseen elements in the test data, the models still give good predictions; such extrapolations into new chemical-space would be impossible with component-based descriptors."
    },
    {
      "name": "Machine learning predictions of superalloy microstructure",
      "publisher": "Comp. Mat. Sci., 201",
      "releaseDate": "2022",
      "url": "https://doi.org/10.1016/j.commatsci.2021.110916",
      "summary": "Gaussian process regression machine learning with a physically-informed kernel is used to model the phase compositions of nickel-base superalloys. The model delivers good predictions for laboratory and commercial superalloys (R^2=0.924 for phase fractions). For four benchmark SX-series alloys the methodology predicts the phase composition better than conventional CALPHAD. Furthermore, unlike CALPHAD Gaussian process regression quantifies the uncertainty in predictions, and can be retrained as new data becomes available."
    },
    {
      "name": "Ultrahigh critical current densities, the vortex phase diagram, and the effect of granularity of the stoichiometric high-Tc superconductor CaKFe4As4",
      "publisher": "Phys. Rev. Mat. 2 074802",
      "releaseDate": "2018",
      "url": "https://journals.aps.org/prmaterials/abstract/10.1103/PhysRevMaterials.2.074802",
      "summary": "A comprehensive study of the critical current densities and the superconducting vortex phase diagram in the stoichiometric superconductor CaKFe4As4 which has a critical temperature of ~35K."
    }
  ],
  "skills": [
    {
      "name": "Programming & machine learning",
      "level": "Expert",
      "keywords": [
        "python",
        "pytorch & gpytorch",
        "scikit-learn & scikit-image",
        "pandas",
        "numba",
        "javascript",
        "C++",
        "linux",
        "git",
        "HPC clusters"
      ]
    },
    {
      "name": "Atomistic Simulation",
      "level": "Experienced",
      "keywords": [
        "Molecular dynamics (LAMMPS)",
        "Density functional theory (CASTEP)"
      ]
    },
    {
      "name": "Presenting",
      "level": "Experienced",
      "keywords": [
        "Technical",
        "Non-technical & outreach"
      ]
    }
  ]
}
